toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
#define TaskARM32
#include "Toastbox/Task.h"
#include "Toastbox/IntState.h"
#include "Assert.h"
#include "System.h"
#include "ICE.h"
#include "STM.h"
#include "USB.h"
#include "QSPI.h"
#include "Battery.h"
#include "BufQueue.h"
#include "SDCard.h"
#include "ImgSensor.h"
#include "ImgSD.h"
#include "USBConfigDesc.h"
#include "MSP430JTAG.h"
using namespace STM;

// MARK: - Peripherals & Types

static const void* _USBConfigDesc(size_t& len);

using _USBType = USBType<
    true,                       // T_DMAEn
    _USBConfigDesc,             // T_ConfigDesc
    STM::Endpoints::DataOut,    // T_Endpoints
    STM::Endpoints::DataIn
>;

static const void* _USBConfigDesc(size_t& len) {
    return USBConfigDesc<_USBType>(len);
}

// We're using 63K buffers instead of 64K, because the
// max DMA transfer is 65535 bytes, not 65536.
static void _BufQueueAssert(bool c) { Assert(c); }
using _BufQueue = BufQueue<uint8_t, 63*1024, 2, _BufQueueAssert>;

#warning TODO: were not putting the _BufQueue code in .sram1 too are we?
[[gnu::section(".sram1")]]
static _BufQueue _Bufs;

struct _TaskUSBDataOut;
struct _TaskUSBDataIn;
struct _TaskReadout;

static void _CmdHandle(const STM::Cmd& cmd);
using _System = System<
    _USBType,
    STM::Status::Modes::STMApp,
    _CmdHandle,
    // Additional Tasks
    _TaskUSBDataOut,
    _TaskUSBDataIn,
    _TaskReadout
>;

constexpr auto& _USB = _System::USB;
using _Scheduler = _System::Scheduler;

static QSPI _QSPI;
static Battery<_Scheduler> _Battery;

using _ICE_CRST_            = GPIO<GPIOPortF, GPIO_PIN_11>;
using _ICE_CDONE            = GPIO<GPIOPortB, GPIO_PIN_1>;
using _ICE_ST_SPI_CS_       = GPIO<GPIOPortE, GPIO_PIN_12>;
using _ICE_ST_SPI_D_READY   = GPIO<GPIOPortA, GPIO_PIN_3>;
using _ICE_ST_FLASH_EN      = GPIO<GPIOPortF, GPIO_PIN_5>;
using _ICE_ST_SPI_CLK       = QSPI::Clk;
using _ICE_ST_SPI_D4        = QSPI::D4;
using _ICE_ST_SPI_D5        = QSPI::D5;
using _MSP_HOST_MODE_       = GPIO<GPIOPortE, GPIO_PIN_3>;
using _MSP_SBW_EN           = GPIO<GPIOPortE, GPIO_PIN_4>;
using _VDD_B_1V8_IMG_SD_EN  = GPIO<GPIOPortE, GPIO_PIN_5>;
using _VDD_B_2V8_IMG_SD_EN  = GPIO<GPIOPortE, GPIO_PIN_2>;
using _MSP_TEST             = GPIO<GPIOPortI, GPIO_PIN_8>;
using _MSP_RST_             = GPIO<GPIOPortF, GPIO_PIN_0>;

[[noreturn]] static void _ICEError(uint16_t line);
using _ICE = ::ICE<_Scheduler, _ICEError>;

[[noreturn]] static void _ImgError(uint16_t line);
using _ImgSensor = Img::Sensor<
    _System::Scheduler,     // T_Scheduler
    _ICE,                   // T_ICE
    _ImgError               // T_Error
>;

[[noreturn]] static void _SDError(uint16_t line);
using _SDCard = SD::Card<
    _System::Scheduler, // T_Scheduler
    _ICE,               // T_ICE
    _SDError,           // T_Error
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    2                   // T_ClkDelayFast (odd values invert the clock)
>;

class _SD {
public:
    static void Reset() {
        _SDCard::Reset();
    }
    
    static void Init() {
        _Reading = false;
        _RCA = _SDCard::Init(&_CardId, &_CardData);
    }
    
    static const SD::CardId& CardId() {
        return _CardId;
    }
    
    static const SD::CardData& CardData() {
        return _CardData;
    }
    
    static void ReadStart(uint32_t blockIdx) {
        if (_Reading) ReadStop(); // Stop current read if one is in progress
        
        _Reading = true;
        _SDCard::ReadStart(blockIdx);
    }
    
    static void ReadStop() {
        _Reading = false;
        _SDCard::ReadStop();
    }
    
private:
    static inline uint16_t _RCA = 0;
    static inline SD::CardId _CardId;
    static inline SD::CardData _CardData;
    static inline bool _Reading = false;
};

// MARK: - Utility Functions

enum class _IMGSDPowerState {
    Uncontrolled,
    Off,
    On,
};

static void _IMGSDPowerStateSet(_IMGSDPowerState state) {
    switch (state) {
    case _IMGSDPowerState::Uncontrolled:
        _VDD_B_1V8_IMG_SD_EN::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        _VDD_B_2V8_IMG_SD_EN::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        break;
    
    case _IMGSDPowerState::Off:
        // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
        _VDD_B_2V8_IMG_SD_EN::Write(0);
        _VDD_B_1V8_IMG_SD_EN::Write(0);
        
        _VDD_B_2V8_IMG_SD_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        _VDD_B_1V8_IMG_SD_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        
        // Rails take ~1.5ms to turn off, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms(2));
        break;
    
    case _IMGSDPowerState::On:
        _VDD_B_2V8_IMG_SD_EN::Write(1);
        _VDD_B_2V8_IMG_SD_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        
        _Scheduler::Sleep(_Scheduler::Us(100)); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
        _VDD_B_1V8_IMG_SD_EN::Write(1);
        _VDD_B_1V8_IMG_SD_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        
        // Rails take ~1ms to turn on, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms(2));
        break;
    }
}

// MARK: - ICE40

namespace _QSPICmd {

static QSPI_CommandTypeDef ICEWrite(size_t len) {
    return QSPI_CommandTypeDef{
        .Instruction = 0,
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        
        .Address = 0,
        .AddressSize = QSPI_ADDRESS_8_BITS,
        .AddressMode = QSPI_ADDRESS_NONE,
        
        .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_8_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        
        .DummyCycles = 0,
        
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_1_LINE,
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

static QSPI_CommandTypeDef ICEApp(const _ICE::Msg& msg, size_t respLen) {
    uint8_t b[8];
    static_assert(sizeof(msg) == sizeof(b));
    memcpy(b, &msg, sizeof(b));
    
