toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    // Enable SD power
    _IMGSDPowerStateSet(_IMGSDPowerState::On);
    
    // Init SD card now that its power has been cycled
    _SD::Init();
    
    // Send SD card info
    alignas(4) const SDCardInfo cardInfo = {
        .cardId = _SD::CardId(),
        .cardData = _SD::CardData(),
    };
    
    _USB.send(Endpoints::DataIn, &cardInfo, sizeof(cardInfo));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
}

static void _SDRead(const STM::Cmd& cmd) {
    const auto& arg = cmd.arg.SDRead;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset chip select in case a read was in progress
    _ICE_ST_SPI_CS_::Write(1);
    
    _SD::ReadStart(arg.block);
    
    // Send status
    _System::USBSendStatus(true);
    
    // Start the Readout task
    _TaskReadout::Start(std::nullopt);
}

void _ImgInit(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Prepare for comms with ICEApp via QSPI
    _ICEAppInit();
    
    // Enable IMG power rails
    _IMGSDPowerStateSet(_IMGSDPowerState::On);
    
    _ImgSensor::Init();
    _ImgSensor::SetStreamEnabled(true);
    
    // Send status
    _System::USBSendStatus(true);
}

void _ImgExposureSet(const STM::Cmd& cmd) {
    const auto& arg = cmd.arg.ImgExposureSet;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    _ImgSensor::SetCoarseIntTime(arg.coarseIntTime);
    _ImgSensor::SetFineIntTime(arg.fineIntTime);
    _ImgSensor::SetAnalogGain(arg.analogGain);
    
    // Send status
    _System::USBSendStatus(true);
}

void _ImgCapture(const STM::Cmd& cmd) {
    const auto& arg = cmd.arg.ImgCapture;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    const uint16_t imageWidth       = (arg.size==Img::Size::Full ? Img::Full::PixelWidth         : Img::Thumb::PixelWidth       );
    const uint16_t imageHeight      = (arg.size==Img::Size::Full ? Img::Full::PixelHeight        : Img::Thumb::PixelHeight      );
    const uint32_t imagePaddedLen   = (arg.size==Img::Size::Full ? ImgSD::Full::ImagePaddedLen   : ImgSD::Thumb::ImagePaddedLen   );
    const Img::Header header = {
        .magic          = Img::Header::MagicNumber,
        .version        = Img::Header::Version,
        .imageWidth     = imageWidth,
        .imageHeight    = imageHeight,
    };
    
    const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, arg.dstRAMBlock, arg.skipCount);
    
    // stats: aligned to send via USB
    alignas(4) const ImgCaptureStats stats = {
        .len            = imagePaddedLen,
        .highlightCount = resp.highlightCount(),
        .shadowCount    = resp.shadowCount(),
    };
    
    // Send ImgCaptureStats
    _USB.send(Endpoints::DataIn, &stats, sizeof(stats));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Arrange for the image to be read out
    _ICE::Transfer(_ICE::ImgReadoutMsg(arg.dstRAMBlock, arg.size));
    
    // Send status
    _System::USBSendStatus(true);
    
    // Start the Readout task
    _TaskReadout::Start(imagePaddedLen);
}

void _BatteryStatusGet(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Send battery status
    alignas(4) const BatteryStatus status = _Battery.status();
    _USB.send(Endpoints::DataIn, &status, sizeof(status));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
}

static void _CmdHandle(const STM::Cmd& cmd) {
    switch (cmd.op) {
    // Host Mode
    case Op::HostModeSet:           _HostModeSet(cmd);                  break;
    // ICE40 Bootloader
    case Op::ICERAMWrite:           _ICERAMWrite(cmd);                  break;
    case Op::ICEFlashRead:          _ICEFlashRead(cmd);                 break;
    case Op::ICEFlashWrite:         _ICEFlashWrite(cmd);                break;
    // MSP430 Bootloader
    case Op::MSPConnect:            _MSPConnect(cmd);                   break;
    case Op::MSPDisconnect:         _MSPDisconnect(cmd);                break;
    // MSP430 Debug
    case Op::MSPRead:               _MSPRead(cmd);                      break;
    case Op::MSPWrite:              _MSPWrite(cmd);                     break;
    case Op::MSPDebug:              _MSPDebug(cmd);                     break;
    // SD Card
    case Op::SDInit:                _SDInit(cmd);                       break;
    case Op::SDRead:                _SDRead(cmd);                       break;
    // Img
    case Op::ImgInit:               _ImgInit(cmd);                      break;
    case Op::ImgExposureSet:        _ImgExposureSet(cmd);               break;
    case Op::ImgCapture:            _ImgCapture(cmd);                   break;
    // Battery
    case Op::BatteryStatusGet:      _BatteryStatusGet(cmd);             break;
    // Bad command
    default:                        _System::USBAcceptCommand(false);   break;
    }
}

// MARK: - ISRs

extern "C" [[gnu::section(".isr")]] void ISR_NMI() {}
extern "C" [[gnu::section(".isr")]] void ISR_HardFault() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_MemManage() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_BusFault() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_UsageFault() { for (;;); }
extern "C" [[gnu::section(".isr")]] void ISR_SVC() {}
extern "C" [[gnu::section(".isr")]] void ISR_DebugMon() {}
extern "C" [[gnu::section(".isr")]] void ISR_PendSV() {}

extern "C" [[gnu::section(".isr")]] void ISR_SysTick() {
    _Scheduler::Tick();
    HAL_IncTick();
}

extern "C" [[gnu::section(".isr")]] void ISR_OTG_HS() {
    _USB.isr();
}

extern "C" [[gnu::section(".isr")]] void ISR_QUADSPI() {
    _QSPI.isrQSPI();
}

extern "C" [[gnu::section(".isr")]] void ISR_DMA2_Stream7() {
    _QSPI.isrDMA();
}

// MARK: - Abort

extern "C" [[noreturn]]
void abort() {
    _System::Abort();
}

// MARK: - Main

int main() {
    _System::Init();
    
    // Enable GPIO clocks
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOI_CLK_ENABLE();
    
    // Init Battery
    {
        _Battery.init();
    }
    
    // Init MSP
    {
        _MSP_HOST_MODE_::Write(1);
        _MSP_HOST_MODE_::Config(GPIO_MODE_OUTPUT_OD, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
        
        _MSP.init();
        
        // Enable SBW voltage translation once _MSP has initialized the MSP_TEST and MSP_RST_ pins
        _MSP_SBW_EN::Write(1);
        _MSP_SBW_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    }
    
    _Scheduler::Run();
    return 0;
}


#warning TODO: remove these debug symbols
#warning TODO: when we remove these, re-enable: Project > Optimization > Place [data/functions] in own section
constexpr auto& _Debug_Tasks              = _Scheduler::_Tasks;
constexpr auto& _Debug_DidWork            = _Scheduler::_DidWork;
constexpr auto& _Debug_CurrentTask        = _Scheduler::_CurrentTask;
constexpr auto& _Debug_CurrentTime        = _Scheduler::_ISR.CurrentTime;
constexpr auto& _Debug_Wake               = _Scheduler::_ISR.Wake;
constexpr auto& _Debug_WakeTime           = _Scheduler::_ISR.WakeTime;
